docs/api/cfd/cases/wave_tank/system/blockMeshDict
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }

// 2D numerical wave tank in the x-z plane (y = one 'empty' cell), from the
// stokesII tutorial: 20 m long x 0.55 m tall, still water depth 0.4 m.
scale 1;
vertices
(
    (0     0     0)
    (20  0     0)
    (20  0.04  0)
    (0     0.04  0)
    (0     0     0.55)
    (20  0     0.55)
    (20  0.04  0.55)
    (0     0.04  0.55)
);
blocks ( hex (0 1 2 3 4 5 6 7) (500 1 55) simpleGrading (1 1 1) );
edges ();
boundary
(
    inlet  { type patch; faces ( (0 4 7 3) ); }
    outlet { type patch; faces ( (1 5 6 2) ); }
    ground { type wall;  faces ( (0 1 2 3) ); }
    top    { type patch; faces ( (4 5 6 7) ); }
    sides  { type empty; faces ( (0 1 5 4) (3 2 6 7) ); }
);
mergePatchPairs ();
