docs/api/cfd/cases/wave_tank/constant/waveProperties
FoamFile { version 2.0; format ascii; class dictionary; object waveProperties; }

inlet
{
    alpha           alpha.water;
    waveModel       StokesII;
    nPaddle         1;
    waveHeight      0.05;
    waveAngle       0.0;
    rampTime        3.0;
    activeAbsorption yes;
    wavePeriod      3;
}
outlet
{
    alpha           alpha.water;
    waveModel       shallowWaterAbsorption;
    nPaddle         1;
}
