docs/api/cfd/cases/wave_tank/0/U
FoamFile { version 2.0; format ascii; class volVectorField; object U; }

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);
boundaryField
{
    inlet  { type waveVelocity; value uniform (0 0 0); }
    outlet { type waveVelocity; value uniform (0 0 0); }
    ground { type fixedValue; value uniform (0 0 0); }
    top    { type pressureInletOutletVelocity; value uniform (0 0 0); }
    sides  { type empty; }
}
