docs/api/cfd/cases/wave_tank/0/p_rgh
FoamFile { version 2.0; format ascii; class volScalarField; object p_rgh; }

dimensions      [1 -1 -2 0 0 0 0];
internalField   uniform 0;
boundaryField
{
    inlet  { type fixedFluxPressure; value uniform 0; }
    outlet { type fixedFluxPressure; value uniform 0; }
    ground { type fixedFluxPressure; value uniform 0; }
    top    { type totalPressure; p0 uniform 0; }
    sides  { type empty; }
}
