docs/api/cfd/cases/wave_tank/0/alpha.water
FoamFile { version 2.0; format ascii; class volScalarField; object alpha.water; }

dimensions      [0 0 0 0 0 0 0];
internalField   uniform 0;
boundaryField
{
    inlet  { type waveAlpha; value uniform 0; }
    outlet { type zeroGradient; }
    ground { type zeroGradient; }
    top    { type inletOutlet; inletValue uniform 0; value uniform 0; }
    sides  { type empty; }
}
