docs/api/cfd/cases/wave_tank/system/fvSolution
FoamFile { version 2.0; format ascii; class dictionary; object fvSolution; }

solvers
{
    "alpha.water.*"
    {
        nAlphaCorr      1;
        nAlphaSubCycles 3;
        cAlpha          1;
    }
    "pcorr.*" { solver PCG; preconditioner DIC; tolerance 1e-6; relTol 0; }
    p_rgh     { solver PCG; preconditioner DIC; tolerance 1e-6; relTol 0.1; }
    p_rghFinal { solver GAMG; smoother DIC; tolerance 1e-7; relTol 0; }
    U      { solver PBiCG; preconditioner DILU; tolerance 1e-6; relTol 0.1; }
    UFinal { solver PBiCG; preconditioner DILU; tolerance 1e-6; relTol 0; }
}
PIMPLE
{
    momentumPredictor no;
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
}
